Revit 2027 API
SizingCalculator Constructor
 Constructs an SizingCalculator instance.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SizingCalculator(
	Document document
)
Public Sub New (
	document As Document
)
public:
SizingCalculator(
	Document^ document
)
new :
        document : Document -> SizingCalculator
Parameters
document Document
 The document associated with this sizing calculator, used for accessing the calculation service in the settings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace